rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Aladdin"]]
---
  def similar
    @similar_movies = Movie.similar_director params[:title]
    if @similar_movies.nil?
      redirect_to root_url, alert: "'#{params[:title]}' has no director info"
    end
    @movie = Movie.find_by title: params[:title]